{
    "Adnane:economy:ar:ar:ONCA": {
        "response": "‫An unexpected error occurred while generating the response.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:ONCA??": {
        "response": "‫An unexpected error occurred while generating the response.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:ONCA????": {
        "response": "‫ONCA stands for \"Office National de Sécurité Sanitaire des produits Alimentaires\" in French, which translates to the National Office of Food Safety in English. It is a government agency in Morocco responsible for ensuring the safety and quality of food products throughout the country. ONCA plays a crucial role in regulating and monitoring the agricultural and food sectors to protect consumers and maintain high standards in food production. The agency is also involved in research, inspections, certifications, and providing guidelines to promote food safety in Morocco. For more detailed information, you can visit their official website at www.onca.gov.ma.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:Définir l'ONCA": {
        "response": "‫L'ONCA, ou Office National de Commercialisation des Produits Agricoles, est un organisme public au Maroc chargé de la commercialisation des produits agricoles. Son rôle principal est de réguler les marchés agricoles en fixant des prix de référence pour certains produits, en organisant des ventes aux enchères, en facilitant les échanges entre producteurs et acheteurs, et en favorisant la transparence des transactions. L'ONCA vise à protéger les intérêts des agriculteurs en assurant des conditions équitables de commercialisation de leurs produits, tout en contribuant à stabiliser les prix sur le marché national. Son action est essentielle pour garantir la viabilité économique du secteur agricole et assurer un revenu décent aux agriculteurs.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:Date de création de l'ONCA": {
        "response": "‫L'Office National de la Commercialisation Agricole (ONCA) a été créé en Algérie le 31 décembre 1996. Cette institution a pour mission de superviser la commercialisation des produits agricoles et agroalimentaires ainsi que de soutenir les agriculteurs en fixant les prix et en assurant la gestion des marchés agricoles.‬",
        "feedback": ""
    },
    "Adnane:premium:fr:fr:Le ministère de l'agriculture au Maroc et ses objectifs": {
        "response": "Le ministère de l'Agriculture au Maroc joue un rôle crucial dans le développement et la modernisation du secteur agricole. Ses objectifs sont diversifiés et visent à répondre aux multiples enjeux actuels et futurs que traverse le pays. Parmi les principaux objectifs, on peut citer :\n\n### 1. Mise en œuvre du Plan Maroc Vert (PMV)\nLancé en 2008, le PMV est une stratégie ambitieuse visant à positionner l'agriculture comme un levier de développement socio-économique au Maroc. Le plan adopte une approche globale qui inclut tous les acteurs du secteur agricole, depuis les exploitants individuels jusqu'aux industries agro-alimentaires. Ses objectifs précis incluent :\n- Assurer la sécurité alimentaire.\n- Développer la valeur ajoutée du secteur agricole.\n- Limiter l'impact des changements climatiques et préserver les ressources naturelles.\n- Promouvoir les exportations de produits agricoles.\n- Valoriser les produits de terroir.\n\n### 2. Structuration du Conseil Agricole\nLa loi 62-12 et les décrets associés visent à renforcer le rôle du conseil agricole pour moderniser les filières de production et améliorer la qualité des services rendus aux agriculteurs. Cela inclut :\n- L'octroi, le renouvellement, la suspension ou le retrait de l'agrément des conseillers agricoles.\n- La tenue d'un registre de conseil agricole.\n- La mise en place de commissions pour superviser l'ensemble de ces processus.\n\n### 3. Création d'emplois et Formation\nL'une des missions du ministère est de créer des opportunités d'emploi pour les diplômés des établissements d'enseignement et de formation agricole, en encourageant l'investissement dans le secteur. Cela inclut :\n- Encourager l'exercice de la prestation de conseil agricole.\n- Promouvoir des projets de développement conduits par des conseillers agricoles qualifiés et expérimentés.\n\n### 4. Intégration et Compétitivité\nLe PMV repose sur deux piliers stratégiques :\n- **Pilier I** : Développement accéléré d'une agriculture moderne et compétitive. Ce pilier vise la réalisation de milliers de projets à haute valeur ajoutée et productivité, basés sur des investissements privés et répondant aux règles du marché.\n- **Pilier II** : Accompagnement solidaire de la petite agriculture familiale, visant à intégrer plus efficacement ce secteur dans l'économie nationale.\n\n### 5. Promotion de l'Agriculture Durable\nDans le contexte actuel de changements climatiques, le ministère met en avant des pratiques agricoles durables en visant à :\n- Utiliser de manière efficiente les ressources en eau et le sol.\n- Adopter des techniques de production agricoles respectueuses de l'environnement.\n\n### Conclusion\nLe ministère de l'Agriculture au Maroc travaille ainsi à transformer le secteur agricole en un pilier de développement durable, intégrant les dimensions économiques, sociales et environnementales. Grâce au Plan Maroc Vert et aux diverses politiques et projets mis en œuvre, le ministère cherche à créer une agriculture marocaine compétitive, inclusive et résiliente face aux défis du futur.",
        "feedback": ""
    },
    "Adnane:premium:fr:fr:Donner une liste des différentes maladies des tomates": {
        "response": "Les tomates sont sujettes à un grand nombre de maladies, qui peuvent être causées par des agents pathogènes tels que les champignons, les bactéries, les virus et les organismes nuisibles. Voici une liste détaillée des principales maladies des tomates :\n\n### 1. Maladies Fongiques :\n1. **Mildiou (Phytophthora infestans)**\n   - Symptômes : Taches brunes sur les feuilles, fruits et tiges, développement de moisissures blanches par temps humide.\n   \n2. **Oïdium (Leveillula taurica, Erysiphe spp.)**\n   - Symptômes : Poudre blanche sur les feuilles, jaunissement et dessèchement des feuilles.\n   \n3. **Fusariose (Fusarium oxysporum f. sp. lycopersici)**\n   - Symptômes : Flétrissement, jaunissement des feuilles, décoloration vasculaire.\n   \n4. **Verticilliose (Verticillium dahliae, Verticillium albo-atrum)**\n   - Symptômes : Flétrissement, jaunissement inégal des feuilles, décoloration vasculaire.\n   \n5. **Alternariose (Alternaria solani)**\n   - Symptômes : Taches brunes en forme de cible sur les feuilles, tiges et fruits.\n\n6. **Pourriture grise (Botrytis cinerea)**\n   - Symptômes : Taches aqueuses qui deviennent grises et moisies, surtout sur les fruits, tiges et feuilles.\n\n### 2. Maladies Bactériennes :\n1. **Chancre bactérien (Clavibacter michiganensis subsp. michiganensis)**\n   - Symptômes : Taches et chancres sur les tiges, fruits et feuilles, décoloration de la moelle.\n   \n2. **Coupe noire (Pseudomonas corrugata)**\n   - Symptômes : Taches noires en relief sur les tiges et les fruits, flétrissement des feuilles.\n\n3. **Tache bactérienne (Xanthomonas campestris pv. vesicatoria)**\n   - Symptômes : Petites taches sombres entourées d’une auréole jaune sur les feuilles et les fruits.\n\n4. **Nécroses sur les racines (Ralstonia solanacearum)**\n   - Symptômes : Flétrissement rapide, brunissement et putréfaction des racines.\n\n### 3. Maladies Virales :\n1. **Virus de la mosaïque de la tomate (Tomato mosaic virus - ToMV)**\n   - Symptômes : Marbrures vert foncé/jaune sur les feuilles, malformation et réduction de taille des fruits.\n   \n2. **Virus de la jaunisse apicale (Tomato yellow leaf curl virus - TYLCV)**\n   - Symptômes : Enroulement des feuilles, retard de croissance, jaunissement des extrémités des feuilles.\n   \n3. **Virus du flétrissement tacheté de la tomate (Tomato spotted wilt virus - TSWV)**\n   - Symptômes : Taches annulaires sur les feuilles, fruits et fleurs, décoloration et flétrissement.\n\n### 4. Maladies causées par des nématodes:\n1. **Nématodes des galles des racines (Meloidogyne spp.)**\n   - Symptômes : Nodules ou galles sur les racines, retard de croissance, flétrissement.\n\n### 5. Maladies Physiologiques :\n1. **Blossom-end rot (Pourriture apicale)**\n   - Symptômes : Taches noires en décomposition à l'extrémité inférieure des fruits, causé par un déséquilibre en calcium.\n\nPour réduire l'incidence de maladies, il est essentiel de pratiquer une bonne gestion agricole, qui inclut la rotation des cultures, l'utilisation de variétés résistantes, la gestion de l'irrigation et un contrôle rigoureux des organismes nuisibles. Des fiches détaillées comme celles du projet PAGIE pourraient offrir des conseils précieux sur la gestion de ces maladies.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Soit plus précis"
        }
    },
    "Adnane:economy:fr:fr:ONCA": {
        "response": "Based on the information provided, here is a detailed response regarding ONCA:\n\nONCA, which stands for l'Office National du Conseil Agricole (National Agricultural Advisory Office), was established in accordance with Law 58-12 promulgated by Dahir No. 1.12.67 on 4 Rabii I 1434 (16 January 2013). The creation of ONCA led to a restructuring of the local agricultural advisory entities, consolidating 122 Technical Centers (CT) under a single public institution. This consolidation aimed to enhance the mobility of public advisors and optimize resources within the agricultural advisory sector.\n\nThe responsibility for steering and governing the national agricultural advisory system was entrusted to ONCA, while regional coordination and activities were delegated to the Regional Agricultural Advisory Directorates (DRCA). Additionally, the newly established Agricultural Advisory Centers (CCA) have become vital hubs for agricultural advice and knowledge sharing with farmers. ONCA has also produced two motion design storytelling videos highlighting cereal production and date palm cultivation, featuring ONCA mascots. These videos are being disseminated through various channels such as the ARDNA platform, social media, and television networks.\n\nFurthermore, ONCA has introduced agricultural podcasts as part of its efforts to provide valuable information to farmers, partners, and the general public. These podcasts serve as a platform for promoting agricultural products, services, and initiatives, as well as for raising awareness about technical and managerial practices for sustainable agricultural development. The digitalization of agricultural advisory services is seen as an innovative initiative that will enhance the effectiveness and efficiency of ONCA's operations.\n\nIn conclusion, ONCA plays a crucial role in coordinating and delivering agricultural advisory services at the national level, fostering partnerships between public and private stakeholders, and promoting best agricultural practices for sustainable development.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "En darija"
        }
    },
    "Adnane:good:fr:fr:ONCA Def": {
        "response": "ONCA (Office National du Conseil Agricole) is a public entity established under the law 58-12 enacted by Dahir N°1.12.67 on January 16, 2013. Its creation was accompanied by a complete restructuring of the local agricultural advisory entities network, enhancing the mobility of public advisors and optimizing resources. Before its establishment, there were 122 CT (Technical Centers) which were integrated into this single public entity, ONCA.\n\nThe entity is tasked with steering and governing the agricultural advisory setup at the national level. Regionally, its coordination and animation task falls under the responsibility of DRCA (Regional Directorates of Agricultural Advisory) entities. Furthermore, new Agricultural Advisory Centers (CCA) have been established, functioning as vital points of communication for agricultural advice, transferring tacit knowledge and sharing good agricultural practices with farmers.\n\nONCA has set up various channels for this, with two storytelling videos in motion design that are shared on various platforms, such as the ARDNA platform, social networks, and TV channels. These videos feature the mascots of ONCA, with the first video focusing on the cereals sector and the second on the date palm sector. The ONCA has also enriched its \"radio broadcasts\" range by integrating agricultural podcasts.\n\nAs an organization dedicated to serving farmers, ONCA is structured around three main domains or departments:\n1. Agricultural Advisory Engineering Directorate: This Directorate is intended to coordinate and monitor the development of different annual regional action plans for agricultural advice, prepare national programs and budgets, and participate in the allocation of resources to different agricultural advisory actors.\n2. Operations Directorate \n3. Human Resources and Support Directorate \n\nOverall, ONCA plays a pivotal role in Moroccan agriculture, drastically altering the way agricultural advice was disseminated and accessed by farmers across the country.\n",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "En arabe"
        }
    },
    "Adnane:economy:fr:fr:ONCA??": {
        "response": "L'ONCA, qui signifie Office National du Conseil Agricole, est un établissement public marocain créé en vertu de la loi 58-12 promulguée par le Dahir N°1.12.67 du 4 Rabii I 1434 (16 Janvier 2013). Son objectif principal est de fournir un conseil agricole de qualité aux agriculteurs, de transférer des connaissances pertinentes et de promouvoir les bonnes pratiques agricoles. \n\nDans le cadre de ses missions, l'ONCA a mis en place une série d'initiatives et de services pour renforcer le partenariat public-privé, organiser le métier de conseiller agricole privé et le déployer à l'échelle nationale conformément à la loi 62-12. L'ONCA a également revu le réseau des entités locales de conseil agricole, absorbant les 122 Centres de Transfert de Technologie (CTT) au niveau d'un seul établissement public. \n\nA travers ses actions, l'ONCA vise à offrir des services diversifiés aux agriculteurs, aux partenaires institutionnels et aux professionnels du secteur agricole. Cela inclut la diffusion de vidéos en motion design mettant en scène les mascottes de l'ONCA pour sensibiliser sur des filières telles que les céréales et le palmier dattier, ainsi que la mise en place de podcasts agricoles pour informer et éduquer le grand public.\n\nEn s'orientant vers la digitalisation du conseil agricole, l'ONCA cherche à améliorer son efficacité et son efficience dans la transmission des connaissances et le partage des bonnes pratiques agricoles. Ces efforts visent à soutenir le développement durable de l'agriculture au Maroc.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Ne pas dépasser 50 mots"
        }
    },
    "Adnane:economy:ar:ar:": {
        "response": "‫User is not authenticated. Please log in.‬",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "C"
        }
    },
    "Adnane:economy:fr:ar:Définir ONCA en arabe": {
        "response": "‫User is not authenticated. Please log in.‬",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Plus de détails"
        }
    },
    "Adnane:premium:fr:ar:Maladies du cerisier ?": {
        "response": "‫أمراض شجرة الكرز متنوعة ويمكن أن تؤثر على جوانب مختلفة من الشجرة، بدءاً من الجذور وصولاً إلى الثمار. إليك نظرة عامة على الأمراض الشائعة التي يمكن أن تصيب أشجار الكرز:\n\n1. **السوسة (إسمرار الأزهار وتعفن الثمار)**:\n   - **الأعراض**: يتغير لون الأزهار إلى البني وتذبل، تتشكل بقع بنية على الثمار التي تعفن ثم تتحنط على الشجرة.\n   - **المُسبب المرضي**: الفطريات _Monilinia laxa_ و_Monilinia fructigena_.\n   - **المكافحة**: إزالة الثمار المحنطة والأغصان المصابة، المعالجة بالمبيدات الفطرية قبل وبعد الإزهار، تحسين التهوية داخل قمة الشجرة من خلال التقليم المناسب.\n\n2. **النقطة القرمزية (التبقع)**:\n   - **الأعراض**: تظهر بقع أرجوانية صغيرة على الأوراق تتحول إلى ثقوب (تبقعات)، بقع على الثمار والأغصان.\n   - **المُسبب المرضي**: الفطر _Wilsonomyces carpophilus_.\n   - **المكافحة**: إزالة الأجزاء المصابة من الشجرة، المعالجة بالمبيدات الفطرية المشتملة على النحاس بعد سقوط الأوراق وفي الربيع.\n\n3. **البياض الدقيقي**:\n   - **الأعراض**: يظهر غشاء أبيض على الأوراق والبراعم الجديدة وأحيانًا الثمار. قد تتشوه الأوراق وتسقط مبكرًا.\n   - **المُسبب المرضي**: الفطر _Podosphaera clandestina_.\n   - **المكافحة**: تطبيق الكبريت أو المبيدات الفطرية المحددة، تحسين دوران الهواء والإضاءة داخل الشجرة من خلال التقليم المناسب.\n\n4. **التقرح البكتيري**:\n   - **الأعراض**: بقع زاوية داكنة على الأوراق محاطة بهالة صفراء، تقرحات على الأغصان والجذع، سائل صمغي نازف.\n   - **المُسبب المرضي**: البكتيريا _Pseudomonas syringae_.\n   - **المكافحة**: استخدام أصناف مقاومة، إزالة وتدمير الأجزاء المصابة، المعالجة بالنحاس في الخريف ونهاية الشتاء.\n\n5. **التصمغ**:\n   - **الأعراض**: خروج صمغ من الجذع والأغصان، غالبًا نتيجة الإصابات أو العدوى.\n   - **الأسباب**: الفطريات، الإصابات الميكانيكية، الضغط اللا مائي أو الرطوبة الزائدة.\n   - **المكافحة**: حماية الأشجار من الإصابات، تحسين ظروف الزراعة (خصوصًا الصرف)، تقليم الأغصان الميتة أو المريضة.\n\nللوقاية وإدارة أمراض شجرة الكرز، من الضروري:\n- **توفير نظافة جيدة للبستان**: إزالة الثمار الساقطة والحطام النباتي بانتظام.\n- **التقليم المناسب**: لتحسين دوران الهواء وتقليل الرطوبة في قمة الشجرة.\n- **تجنب إصابة الأشجار**: حيث يمكن أن تكون مدخلاً للعوامل المرضية.\n- **مراقبة الأشجار بانتظام**: للكشف المبكر عن علامات الأمراض والتدخل السريع.\n\nالنشرات وأدوات الاستشارة الزراعية المطورة، كما هو مذكور في المعلومات المقدمة، يمكن أن توفر تفاصيل إضافية ونصائح عملية لإدارة هذه الأمراض. يُشجع المزارعون على المشاركة في جلسات التدريب واستخدام المنصات المختلفة للحصول على النصائح والمعلومات الحديثة.‬",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Ne pas dépasser 200 mots"
        }
    },
    "Adnane:premium:fr:dar:Définir ONCA": {
        "response": "وقع خطأ غير متوقع وأنا كنولد الرد.",
        "feedback": ""
    },
    "Adnane:premium:fr:dar:Définir l'ONCA": {
        "response": "وقعت خطأ غير متوقع أثناء توليد الرد.",
        "feedback": ""
    },
    "Adnane:premium:fr:dar:Définir l'ONCA?": {
        "response": "المكتب الوطني للاستشارة الفلاحية (ONCA) هو هيئة عمومية مغربية، تأسست بموجب القانون 58-12 اللي صدر بظهير ن°1.12.67 ديال 4 ربيع الأول 1434 (16 يناير 2013). الهدف الرئيسي ديال ONCA هو تعزيز نظام الاستشارة الفلاحية من خلال تنظيم مركزي وفعال، باش يخدم الفلاحين بشكل كفؤ ومندمج ف الإطار المؤسسي.\n\n### التنظيم والحكامة\n#### الهيكلة المركزية\n- **مديرية هندسة الاستشارة الفلاحية**: مسؤولة على التنسيق وتتبع خطط العمل السنوية والمتعددة السنوات الجهوية، وكذلك إعداد البرامج والميزانيات. كتشارك أيضاً ف تخصيص الموارد للأطراف المختلفة للاستشارة الفلاحية.\n- **مديرية العمليات**: كتدير وتنسق العمليات اليومية المتعلقة بالاستشارة الفلاحية.\n- **مديرية الموارد البشرية والدعم**: كتعتني بالجوانب الإدارية وإدارة الموارد البشرية والوسائل الدعم الضرورية لعمل ONCA.\n\n#### الانتشار الجهوي\n- المديريات الجهوية للاستشارة الفلاحية (DRCA) هي المسؤولة على التنسيق وتنشيط الاستشارة الفلاحية على المستوى الجهوي.\n- المراكز الجدد للاستشارة الفلاحية (CCA) كتلعَب دور مهم ف توفير نقاط جدب للفلاحين، كي يسهلوا نشر المعرفة والممارسات الفلاحية الجيدة.\n\n### المهام والأنشطة\n- **تعزيز الشراكة بين القطاعين العام والخاص**: كتدعم التعاون بين القطاعين العام والخاص باش تكون الاستشارة الفلاحية أكثر فعالية.\n- **التنقل والفعالية**: إعادة هيكلة الشبكة ديال الكيانات المحلية كي يسمح بتنقل أفضل للمستشارين العموميين وزيادة فعالية الوسائل المحددة.\n- **تعاقد الاستشارة الفلاحية الخاصة**: كتدير وتنظيم مهنة المستشار الفلاحي الخاص على المستوى الوطني ف إطار القانون 62-12.\n\n### الابتكارات وقنوات التوصيل\n- **E-Dalil El Fellah**: أداة تواصل ونقل المعرفة موجهة للفلاحين.\n- **فيديوهات القصة بالحركة (موشن ديزاين)**: منتجة باش يتم الاعتماد على الفلاح ونقل المعرفة، هذه الفيديوهات",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:ONCA?????": {
        "response": "‫An unexpected error occurred while generating the response.‬",
        "feedback": ""
    },
    "Adnane:economy:fr:ar:ONCA": {
        "response": "‫تشير كلمة \"ONCA\" إلى المكتب الوطني للاستشارة الفلاحية في المغرب. أُنشئ المكتب الوطني للاستشارة الفلاحية بموجب القانون 58-12 الصادر عن الظهير الشريف رقم 1.12.67 في 16 يناير 2013. أدى إنشاء المكتب الوطني للاستشارة الفلاحية إلى إعادة هيكلة الجهات المحلية المشرفة على الاستشارة الفلاحية، من خلال دمج 122 مركزاً للاستشارة الفلاحية في جهة واحدة؛ يعتبر المكتب الوطني للاستشارة الفلاحية هيئة عمومية تهدف إلى تعزيز حركة المستشارين الفلاحيين العموميين وتحسين استخدام الموارد.\n\nيتولى المكتب الوطني للاستشارة الفلاحية الإشراف على النظام الوطني للاستشارة الفلاحية، بينما يتم إدارة التنسيق والأنشطة على المستوى الإقليمي من قبل المديريات الجهوية للاستشارة الفلاحية (DRCA). وتعمل مراكز الاستشارة الفلاحية الجديدة (CCA) التي أنشأها المكتب الوطني كوسائل فعالة للتواصل في مجال الاستشارة الفلاحية، بهدف زيادة المعرفة الزراعية للمزارعين ونشر أفضل الممارسات الزراعية.\n\nلتعزيز التواصل مع الجمهور المستهدف ونشر المعرفة الفلاحية، أطلق المكتب الوطني للاستشارة الفلاحية العديد من المبادرات، بما فيها إنتاج فيديوهات تصميم الحكايات المتحركة، التي تركز على قطاعات الحبوب ونخيل التمر. تُظهر هذه الفيديوهات شخصيات المكتب الوطني وتُشارك عبر منصات مثل ARDNA، ووسائل التواصل الاجتماعي، والقنوات التلفزيونية. بالإضافة إلى ذلك، أطلق المكتب الوطني للاستشارة الفلاحية بودكاستات زراعية تهدف إلى تقديم معلومات للمزارعين حول المنتجات والخدمات الزراعية، وتشجيع العروض المؤسسية والمهنية، والتوعية بالجانب الفني والإداري لتحقيق تنمية زراعية مستدامة.\n\nيعكس التحول الرقمي في مجال الاستشارة الفلاحية من خلال مبادرات مثل البودكاست والمنصات الإلكترونية التزام المكتب الوطني للاستشارة الفلاحية بالابتكار والكفاءة في تقديم الخدمات الزراعية. من خلال الاستفادة من التكنولوجيا والشراكات الاستراتيجية، يسعى المكتب الوطني لتعزيز فعالية واستدامة الممارسات الزراعية في المغرب.‬",
        "feedback": ""
    },
    "Adnane:economy:fr:fr:Définir ONCA????": {
        "response": "An error occurred while generating the response.",
        "feedback": ""
    }
}