{
    "Adnane:premium:fr:fr:C'est quoi ONCA": "L'ONCA, ou Office National du Conseil Agricole, est une organisation marocaine dédiée à fournir des services de conseil agricole aux agriculteurs. Sa mission principale est de transférer des connaissances tacites et de partager les meilleures pratiques agricoles pour améliorer la productivité et la durabilité des exploitations agricoles au Maroc.\n\n### Mission et Objectifs\nL'ONCA vise à capitaliser sur l'expérience des agriculteurs et à diffuser des connaissances pratiques par divers moyens de communication. L'objectif est de renforcer la compétence des agriculteurs grâce à des conseils techniques et des ressources pédagogiques, tout en facilitant le partage de bonnes pratiques.\n\n### Moyens de Communication\nPour atteindre ses buts, l'ONCA utilise plusieurs méthodes de communication innovantes :\n- **Vidéos Storytelling en Motion Design**: Deux vidéos ont déjà été produites, une sur la filière céréalière et une autre sur le palmier dattier. Ces vidéos seront diffusées sur la plateforme ARDNA, les réseaux sociaux, et les chaînes de télévision. Elles seront également partagées avec des conseillers agricoles dans diverses régions.\n- **Podcasts Agricoles**: Ces podcasts visent à enrichir les offres radiophoniques en fournissant des contenus attractifs et informatifs pour les agriculteurs.\n\n### Organisation Interne\nL'ONCA est structurée autour de trois principales directions :\n1. **Direction d'Ingénierie du Conseil Agricole**: Cette direction est responsable de la coordination et du suivi de la mise en œuvre des plans d'action régionaux annuels, ainsi que de l'élaboration des programmes et budgets nationaux et pluriannuels de conseil agricole.\n2. **Direction des Opérations**: Gère les opérations sur le terrain pour s'assurer que les services de conseil sont bien déployés et que les objectifs sont atteints.\n3. **Direction des Ressources Humaines et Support**: Assure le soutien administratif et RH nécessaire pour le bon fonctionnement de l'ONCA.\n\n### Gouvernance et Réseautage\nLa création de l'ONCA a entraîné une refonte du réseau des entités locales de conseil agricole. L'organisation regroupe désormais les 122 centres techniques (CT) en une seule entité publique. Cette rationalisation permet d'optimiser les ressources et d'améliorer la mobilité des conseillers agricoles. La coordination et l'animation régionale sont assurées par les Directions Régionales",
    "Adnane:economy:ar:ar:C'est quoi ONCA": "‫ONCA, or l’Office National du Conseil Agricole in French, is a governmental organisation in Morocco. It is dedicated to providing guidance and support for agricultural professionals in areas like sustainable development, market development, and technical advancement. Their work aims to improve the profitability of agriculture and ensure its sustainable growth. They are a crucial link among farmers, research organizations, and government departments, ensuring that the most recent scientific findings and technological innovations are being used to benefit Moroccan agriculture. Their services include advice on crop management, pest control, irrigation techniques, and other crucial aspects of farming. \n\nTheir provided contact number is +212 537 77 65 13 and their fax number is +212 537 77 92 89. They also appear to have resources available on their website at www.onca.gov.ma. \n\nAdditionally, the source mentions www.ardna.org, which could be relevant in the context, however, without additional details, it remains unclear how it relates to ONCA.‬",
    "Adnane:economy:ar:ar:C'est quoi ONCA?": "‫L'Office National du Conseil Agricole (ONCA) est une institution publique marocaine qui a été mise en place pour promouvoir le développement de l'agriculture au Maroc. Il cherche à améliorer la productivité et l'efficacité des exploitations agricoles à travers des initiatives de sensibilisation, des programmes de formation, et en fournissant des conseils techniques aux agriculteurs. L'ONCA travaille également pour encourager l'innovation et l'adoption de nouvelles technologies dans le secteur agricole.\n\nLe site web officiel de l'ONCA est: www.onca.gov.ma. Sur le site, vous pouvez trouver une variété de ressources et d'informations sur les activités de l'ONCA, des initiatives en cours, et des conseils agricoles.\n\nARDNA, ou l'Agence de Recherche pour le Développement de l'Agriculture au Maroc, est une autre organisation marocaine qui travaille en étroite collaboration avec l'ONCA pour soutenir le développement agricole.\n\nSi vous avez des questions supplémentaires ou avez besoin d'un conseil agricole, vous pouvez contacter l'ONCA directement. Le numéro de téléphone est le +212 537 77 65 13, et le numéro de fax est le +212 537 77 92 89.‬"
}