{
    "Adnane:good:fr:fr:Définir l'ONCA": {
        "response": "L'ONCA, (Office National du Conseil Agricole), est une organisation conçue pour servir les agriculteurs. Elle a pour but de répondre aux missions de conseil agricole et garantir une bonne intégration de l'office dans son environnement institutionnel. L'organisation est structurée en trois directions principales : la Direction d’Ingénierie du Conseil Agricole, la Direction des Opérations et la Direction des Ressources Humaines et Support.\n\nLa Direction d’Ingénierie du Conseil Agricole se charge de coordonner et suivre l’élaboration des différents plans d’action régionaux annuels de conseil agricole, d'élaborer les programmes et les budgets, annuels et pluriannuels, de conseil agricole au niveau national et participer à l’allocation des ressources aux différents acteurs de conseil agricole.\n\nDans le cadre de la loi 58-12, l'ONCA a subi une restructuration de son réseau d’entités locales de conseil agricole, optimisant ainsi la mobilité des conseillers publics et l’usage des ressources. Les 122 centres techniques (CT) ont été regroupés dans un seul établissement public (ONCA). C'est l'ONCA qui est chargée du pilotage et de la gouvernance du dispositif du conseil agricole au niveau national, tandis que la coordination et l'animation au niveau régional sont sous la responsabilité des Directions Régionales du Conseil Agricole (DRCA).\n\nLa ONCA utilise également des méthodes de communication innovantes pour partager les meilleures pratiques agricoles, dont des vidéos et des podcasts, afin de soutenir les agriculteurs et de faciliter la diffusion d'informations utiles.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Soit plus précis"
        }
    },
    "Adnane:good:fr:fr:Définir Les roles du ministère de l'agriculture relatifs au conseil agricole": {
        "response": "Le Ministère de l'Agriculture a un rôle crucial dans le conseil agricole, surtout en ce qui concerne la mise en œuvre de la loi n°62-12, qui organise l'exercice de la profession de conseiller agricole. Selon cette loi, le ministère a la responsabilité de désigner les critères et modalités pour l'attribution, le renouvellement, la suspension et le retrait de l'agrément d'exercer en tant que conseiller agricole.\n\nEn outre, le ministère est également en charge de la nomination des professionnels au sein de la Commission Nationale du Conseil Agricole. Cela implique l'identification et la sélection des individus ayant les compétences et l'expertise nécessaires pour contribuer efficacement à la mise en œuvre des lois et politiques agricoles.\n\nDe plus, le ministère est responsable de l'établissement du programme de formation nécessaire pour obtenir une attestation de qualification pour l'exercice de conseiller agricole. Cela signifie qu'il fixe les exigences et normes éducatives que les individus doivent remplir pour devenir des conseillers agricoles qualifiés.\n\nEnfin, le ministère joue un rôle essentiel dans le soutien et la promotion des efforts visant à améliorer et à renforcer les capacités des exploitants et des entreprises agricoles. Cela comprend la fourniture de formations, d'informations, d'accompagnements et de la réalisation d'études technico-économiques destinés à améliorer la production, la commercialisation, la valorisation des produits agricoles et l'organisation professionnelle.\n\nEn résumé, le rôle du ministère de l'agriculture dans le conseil agricole est multifonctionnel, couvrant les aspects réglementaires, éducatifs et de soutien.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Soit plus précis"
        }
    },
    "Adnane:economy:ar:ar:Ou se trouve l'ENAM ?": {
        "response": "‫An unexpected error occurred while generating the response.‬",
        "feedback": ""
    },
    "Adnane:economy:fr:fr:Ou se trouve l'ENAM ?": {
        "response": "An unexpected error occurred while generating the response.",
        "feedback": ""
    },
    "Adnane:premium:fr:fr:C'est quoi l'ONCA ?": {
        "response": "An error occurred while generating the response.",
        "feedback": ""
    }
}