{
    "Adnane:economy:ar:ar:ONCA": {
        "response": "‫An unexpected error occurred while generating the response.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:ONCA??": {
        "response": "‫An unexpected error occurred while generating the response.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:ONCA????": {
        "response": "‫ONCA stands for \"Office National de Sécurité Sanitaire des produits Alimentaires\" in French, which translates to the National Office of Food Safety in English. It is a government agency in Morocco responsible for ensuring the safety and quality of food products throughout the country. ONCA plays a crucial role in regulating and monitoring the agricultural and food sectors to protect consumers and maintain high standards in food production. The agency is also involved in research, inspections, certifications, and providing guidelines to promote food safety in Morocco. For more detailed information, you can visit their official website at www.onca.gov.ma.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:Définir l'ONCA": {
        "response": "‫L'ONCA, ou Office National de Commercialisation des Produits Agricoles, est un organisme public au Maroc chargé de la commercialisation des produits agricoles. Son rôle principal est de réguler les marchés agricoles en fixant des prix de référence pour certains produits, en organisant des ventes aux enchères, en facilitant les échanges entre producteurs et acheteurs, et en favorisant la transparence des transactions. L'ONCA vise à protéger les intérêts des agriculteurs en assurant des conditions équitables de commercialisation de leurs produits, tout en contribuant à stabiliser les prix sur le marché national. Son action est essentielle pour garantir la viabilité économique du secteur agricole et assurer un revenu décent aux agriculteurs.‬",
        "feedback": ""
    },
    "Adnane:economy:ar:ar:Date de création de l'ONCA": {
        "response": "‫L'Office National de la Commercialisation Agricole (ONCA) a été créé en Algérie le 31 décembre 1996. Cette institution a pour mission de superviser la commercialisation des produits agricoles et agroalimentaires ainsi que de soutenir les agriculteurs en fixant les prix et en assurant la gestion des marchés agricoles.‬",
        "feedback": ""
    }
}