{
    "Adnane:economy:ar:ar:ONCA": {
        "response": "‫The Office National du Conseil Agricole, or ONCA, is a governmental agency in Morocco that is responsible for providing agricultural advisory services to farmers and promoting sustainable agricultural practices. ONCA plays a crucial role in supporting farmers by offering technical assistance, training programs, and access to information and resources to improve agricultural productivity and efficiency. The agency collaborates with various stakeholders in the agricultural sector to enhance the competitiveness of Moroccan agriculture and ensure food security. Farmers can benefit from ONCA's expertise by attending training sessions, workshops, and receiving personalized advice on crop management, soil health, pest control, and other important agricultural practices.‬",
        "feedback": ""
    },
    "Adnane:premium:fr:fr:Définir l'ONCA??": {
        "response": "L'ONCA, ou Office National du Conseil Agricole, est une organisation dédiée au service des agriculteurs au Maroc. Créée en vertu de la loi 58-12 promulguée par le Dahir N°1.12.67 du 4 Rabii I 1434 (16 janvier 2013), l'ONCA a pour missions principales de piloter et de gouverner le dispositif du conseil agricole au niveau national.\n\nL'ONCA s'organise autour de trois directions centrales :\n1. **Direction d’Ingénierie du Conseil Agricole** : Cette direction est responsable de la coordination et du suivi de l’élaboration des différents plans d’action régionaux annuels de conseil agricole. Elle élabore les programmes et les budgets, tant annuels que pluriannuels, de conseil agricole au niveau national et participe à l’allocation des ressources aux différents acteurs de conseil agricole.\n2. **Direction des Opérations** : Cette direction est chargée de la mise en œuvre opérationnelle des plans, des programmes et des actions de conseil agricole sur le terrain.\n3. **Direction des Ressources Humaines et Support** : Elle gère les ressources humaines et fournit le support nécessaire au bon fonctionnement de l'ONCA.\n\nLe modèle de gouvernance de l'ONCA favorise la mobilité des conseillers publics et l'optimisation des moyens en intégrant les 122 Centres Techniques (CT) locaux dans un seul établissement public. Cela a permis une meilleure structuration et coordination des services de conseil agricole. Au niveau régional, ce sont les Directions Régionales du Conseil Agricole (DRCA) qui sont responsables de la coordination et de l'animation du conseil agricole.\n\nL'ONCA promeut également des méthodes innovantes de communication et de transfert de connaissances, telles que des vidéos storytelling en motion design et des podcasts agricoles, pour diffuser les bonnes pratiques agricoles auprès des agriculteurs et des conseillers agricoles. Ces initiatives visent à renforcer l'importance des pratiques agricoles durables et à améliorer la qualité des services de conseil offerts aux agriculteurs.\n\nEn résumé, l'ONCA joue un rôle central dans l'encadrement, le soutien et l'amélioration des pratiques agricoles au Maroc, tout en favorisant la collaboration entre les secteurs public et privé pour une agriculture durable et productive.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Soit plus précis"
        }
    }
}