{
    "Adnane:good:fr:fr:Définir l'ONCA": {
        "response": "L'ONCA, (Office National du Conseil Agricole), est une organisation conçue pour servir les agriculteurs. Elle a pour but de répondre aux missions de conseil agricole et garantir une bonne intégration de l'office dans son environnement institutionnel. L'organisation est structurée en trois directions principales : la Direction d’Ingénierie du Conseil Agricole, la Direction des Opérations et la Direction des Ressources Humaines et Support.\n\nLa Direction d’Ingénierie du Conseil Agricole se charge de coordonner et suivre l’élaboration des différents plans d’action régionaux annuels de conseil agricole, d'élaborer les programmes et les budgets, annuels et pluriannuels, de conseil agricole au niveau national et participer à l’allocation des ressources aux différents acteurs de conseil agricole.\n\nDans le cadre de la loi 58-12, l'ONCA a subi une restructuration de son réseau d’entités locales de conseil agricole, optimisant ainsi la mobilité des conseillers publics et l’usage des ressources. Les 122 centres techniques (CT) ont été regroupés dans un seul établissement public (ONCA). C'est l'ONCA qui est chargée du pilotage et de la gouvernance du dispositif du conseil agricole au niveau national, tandis que la coordination et l'animation au niveau régional sont sous la responsabilité des Directions Régionales du Conseil Agricole (DRCA).\n\nLa ONCA utilise également des méthodes de communication innovantes pour partager les meilleures pratiques agricoles, dont des vidéos et des podcasts, afin de soutenir les agriculteurs et de faciliter la diffusion d'informations utiles.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Soit plus précis"
        }
    },
    "Adnane:good:fr:fr:Définir Les roles du ministère de l'agriculture relatifs au conseil agricole": {
        "response": "Le Ministère de l'Agriculture a un rôle crucial dans le conseil agricole, surtout en ce qui concerne la mise en œuvre de la loi n°62-12, qui organise l'exercice de la profession de conseiller agricole. Selon cette loi, le ministère a la responsabilité de désigner les critères et modalités pour l'attribution, le renouvellement, la suspension et le retrait de l'agrément d'exercer en tant que conseiller agricole.\n\nEn outre, le ministère est également en charge de la nomination des professionnels au sein de la Commission Nationale du Conseil Agricole. Cela implique l'identification et la sélection des individus ayant les compétences et l'expertise nécessaires pour contribuer efficacement à la mise en œuvre des lois et politiques agricoles.\n\nDe plus, le ministère est responsable de l'établissement du programme de formation nécessaire pour obtenir une attestation de qualification pour l'exercice de conseiller agricole. Cela signifie qu'il fixe les exigences et normes éducatives que les individus doivent remplir pour devenir des conseillers agricoles qualifiés.\n\nEnfin, le ministère joue un rôle essentiel dans le soutien et la promotion des efforts visant à améliorer et à renforcer les capacités des exploitants et des entreprises agricoles. Cela comprend la fourniture de formations, d'informations, d'accompagnements et de la réalisation d'études technico-économiques destinés à améliorer la production, la commercialisation, la valorisation des produits agricoles et l'organisation professionnelle.\n\nEn résumé, le rôle du ministère de l'agriculture dans le conseil agricole est multifonctionnel, couvrant les aspects réglementaires, éducatifs et de soutien.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "Soit plus précis"
        }
    },
    "Adnane:economy:ar:ar:Ou se trouve l'ENAM ?": {
        "response": "‫An unexpected error occurred while generating the response.‬",
        "feedback": ""
    },
    "Adnane:economy:fr:fr:Ou se trouve l'ENAM ?": {
        "response": "An unexpected error occurred while generating the response.",
        "feedback": ""
    },
    "Adnane:premium:fr:fr:C'est quoi l'ONCA ?": {
        "response": "An error occurred while generating the response.",
        "feedback": ""
    },
    "Adnane:economy:fr:fr:Qui est Mohamed El Amrani": {
        "response": "An error occurred while generating the response.",
        "feedback": ""
    },
    "Adnane:economy:fr:fr:C'est qui Mohamed El Amrani": {
        "response": "An error occurred while generating the response.",
        "feedback": ""
    },
    "Adnane:premium:fr:fr:Qui est Mohamed El Amrani": {
        "response": "Mohamed El Amrani est un enseignant-chercheur au Département d'Ingénierie du Développement à l'École Nationale d'Agriculture de Meknès depuis 1992. De formation initiale ingénieur agronome spécialisé en sciences de la vulgarisation, il a approfondi ses études doctorales dans le domaine de la sociologie et de l'économie rurale à la Faculté Universitaire des Sciences Agronomiques de Gembloux, Belgique, où il a soutenu sa thèse en 2001.\n\nSa thèse d'État porte sur l'évaluation de l'impact de la diffusion d'une innovation technique agricole sur les systèmes de production et sur la durabilité de l'agriculture, prenant comme cas d'étude la motopompe à eau dans la zone semi-aride de Sais au Maroc. Une thèse annexe aborde l'analyse conceptuelle de l'IFI, GED, et ASEG, et son application dans le contexte marocain, en soulignant la nécessité d'une nouvelle approche pour l'intégration des femmes rurales aux projets de développement.\n\nÀ l'École Nationale d'Agriculture de Meknès, il est responsable de plusieurs enseignements, notamment sur les méthodologies de conseil agricole, les processus d'innovation et de transfert des technologies, les politiques agricoles et rurales, et la gestion sociale et institutionnelle des ressources naturelles. Il a encadré une centaine de travaux de recherche.\n\nMohamed El Amrani a aussi contribué et supervisé divers projets de développement agricole et rural au Maroc, souvent en collaboration avec des organisations internationales et bailleurs de fonds. Il est membre de l'Association Internationale de Vulgarisation Agricole (AIAEE) et coordonnateur de la Revue Alternatives Rurales. Sa première édition méthodologique a été publiée en janvier 2017 par Marzak Impression à Meknès, Maroc.",
        "feedback": ""
    },
    "Adnane:premium:fr:dar:Mohamed El Amrani": {
        "response": "محمد العمراني هو أكاديمي وباحث بارز فالمدرسة الوطنية الفلاحية (ENA) فمكناس، المغرب. كان جزء من ENA منذ عام 1992، فين كيخدم فقسم الهندسة الإنمائية. تخرج كمهندس زراعي متخصص فعلم الإرشاد، اللي كيهتم بنشر التكنولوجيا والممارسات الفلاحية للفلاحين.\n\nالعمراني كمل دراسات الدكتوراه ديالو فكلية العلوم الفلاحية ديال جامعة جيملوكس فبلجيكا، فين ركز على السوسيولوجيا والاقتصاد الريفي، وحصل على دكتوراه ديالو في عام 2001. أطروحة الدكتوراه ديالو كانت على تأثير نشر ابتكار تقني فلاحى، بالخصوص محرك الماء، على نظم الإنتاج واستدامة الفلاحة فالمنطقة شبه الجافة ديال ساس، المغرب.\n\nبالإضافة للعمل ديالو كأستاذ وباحث، العمراني كيشارك فعديد من المجالات ديال التعليم الفلاحي والتطوير. كيدرس مواد مختلفة فالمدرسة الوطنية الفلاحية فمكناس، مثل مناهج الإرشاد الفلاحي، عمليات نقل التكنولوجيا، السياسات الفلاحية والقروية، وإدارة الموارد الطبيعية الاجتماعية والمؤسساتية. التفاني ديالو فالتعليم واضح من خلال إشرافه على اكثر من مئة مشروع بحثي.\n\nالعمراني كيساهم بشكل كبير ففهم ديناميات تحديث الفلاحة والتنمية الريفية فالمغرب. مثلا، العمل ديالو تحت عنوان \"تقييم تأثير نشر ابتكار تقني فلاحى على نظم الإنتاج وعلى استدامة الفلاحة\" (2001) كيدرس بشكل معمق إدخال محرك الماء فمنطقة ساس. بالإضافة لذلك، الأبحاث ديالو كتأكد على ضرورة دمج النساء الريفيات فمشاريع التنمية فالمغرب، كيبين على الفهم الشامل لكل من الجوانب الاجتماعية والتقنية لعلوم الفلاحة.\n\nتحليل العمراني كيتمدد لمواضيع السياسات. أطروحة ديالو في عام 1997 كتدرس دور الإرشاد الفلاحي فتحديث الفلاحة المغربية، موضوع مهم لبلاد اللي كتعتامد بشكل كبير على الفلاحة للاستقرار والنمو الاقتصادي.\n\nعلاوة على ذلك، كيتعاون العمراني بشكل واسع مع باحثين آخرين فدراسات مهمة. مثلا، العمل ديالو مع نيكولاس فيسا والآخرين فـ \"الرجال والأشجار: العلاقة بين الفاعلين فمشاريع ركيزة II لخطة المغرب الأخضر\" منشورة فمجلة بدائل ريفية، والبحث المشترك ديالو مع باتريك دوغي وآخرين على ابتكار الفلاحة العائلية فالهضبة ديال ساس فالمغرب، منشور فمجلة الزراعة، كيبين نهجه التعاوني فالتعامل مع القضايا الفلاحية المعقدة.\n\nبصفة عامة، محمد",
        "feedback": ""
    },
    "Adnane:premium:fr:dar:Définir les maladis tes tomates et comment les traiter": {
        "response": "الطماطم كتعاني من بزاف ديال الأمراض اللي يمكنها تأثر سلبياً على الإنتاج ديالها. هنا بعض الأمراض الشائعة والطريقة ديال التعامل معاها:\n\n1. **البياض الدقيقي (Oïdium):**\n   - **الأعراض:** كتشوف بقع بيضاء بحال الطحين على الأوراق.\n   - **العلاج:** استخدم مبيدات فطرية اللي مخصصة لهاد النوع من البياض، وقم بتحسين التهوية حول النباتات بإنقاص الكثافة النباتية.\n\n2. **البياض الزغبي (Mildiou):**\n   - **الأعراض:** أوراق ناشفة وبها بقع صفراء وبنية، وكيمكن تشوف فطر رمادي من الفوق.\n   - **العلاج:** استخدم المبيدات الفطرية اللي كتحتوي على النحاس، وخصك تحافظ على نظافة وإزالة النباتات المصابة.\n\n3. **العفن الرمادي (Botrytis):**\n   - **الأعراض:** ظهور العفن الرمادي على الثمار والأوراق.\n   - **العلاج:** تقليل الرطوبة، تحسين التهوية، واستعمال مبيدات فطرية مخصصة للعفن الرمادي.\n\n4. **البقع الجرثومية (Bacterial Spot):**\n   - **الأعراض:** بوادر سودة على الأوراق والشحم.\n   - **العلاج:** استخدام مبيدات اللي كتحتوي على النحاس، وحاول تشري البذور اللي كتكون مقاومة لهاد المرض.\n\n5. **الفيروسات (مثل فيروس التجعد الأصفر):**\n   - **الأعراض:** أوراق ملتوية، نمو متعثر، ولون أصفر في الأوراق.\n   - **العلاج:** ماكاينش علاج مباشر ولكن خصك تقاوم الحشرات الناقلة بحال الذبابة البيضاء.\n\n6. **النيماتودا (Nematodes):**\n   - **الأعراض:** الجذور كتعاني وتقدر تشوف تورمات صغيرة عليها.\n   - **العلاج:** استعمال نباتات محصنة، ودير تناوب المحاصيل، واستعمل منتجات اللي كتموت النيماتودا (نماتوديسايد).\n\n7. **الذبابة البيضاء:**\n   - **الأعراض:** الأوراق كيبداو يسفرو وكيبان حشرات صغيرة بيضاء عليهم.\n   - **العلاج:** استعمال مبيدات حشرية ملائمة، وتقدر تستعمل شبكة مكافحة الحشرات لحماية النباتات.\n\nباش تهتم بالطماطم مزيان، خصك دير فحص دوري للنباتات ديالك، وتبدأ الإجراءات اللازمة فور مشاهدتك أي أعراض أنه غير عادية. تحسين التهوية والتربة والصرف ديال الماء عوامل مهمة للوقاية من الأمراض.",
        "feedback": {
            "relevance": 0,
            "accuracy": 0,
            "fluency": 0,
            "additional_comments": "اكتب الكل بالدارجة"
        }
    },
    "Adnane:premium:fr:dar:Qui est Mohamed El Amrani ?": {
        "response": "محمد العمراني هو أستاذ باحث في قسم الهندسة التنمية في المدرسة الوطنية للفلاحة (ENA) في مكناس، المغرب، حيث يزاول منذ 1992. هو متخصص في علوم الإرشاد الفلاحي، مع تكوين أولي كمهندس زراعي.\n\nبعد الدراسات ديال الهندسة، محمد العمراني كمل دراسات الدكتوراه في مجال السوسيولوجيا والاقتصاد القروي في كلية العلوم الزراعية في جيمبلوكس، بلجيكا، فين دافع الأطروحة ديالو في 2001. الأطروحة ديالو كانت على تطار الاثر ديال انتشار ابتكار تقني فلاحي على النظم الإنتاجية والاستدامة ديال الفلاحة، مع دراسة خاصة على الموتوبومب ديال الماء في المنطقة شبه القاحلة ديال ساس في المغرب.\n\nمحمد العمراني كذلك تفتحو على اندماج النساء القرويات في مشاريع التنمية في المغرب، واقترح مقاربات جديدة ف هاد المجال.\n\nفي المدرسة الوطنية للفلاحة في مكناس، محمد العمراني مكلف بعدة دروس، منها مناهج الاستشارة الفلاحية، وعمليات الابتكار ونقل التكنولوجيات، والسياسات الفلاحية والقروية، والتدبير الاجتماعي والمؤسساتي للموارد الطبيعية.\n\nسهر على مائة مشاريع بحثية، وشرف او ساهم كخبير في عدة دراسات ومشاريع الفلاحة والتنمية القروية في المغرب، لصالح منظمات مختلفة والجهات المانحة الدولية.\n\nإضافة إلى النشاطات ديالو في التدريس والبحث العلمي، محمد العمراني عضو ف الجمعية الدولية للإرشاد الفلاحي (AIAEE) ومنسق ديال مجلة الطرائق البديلة القروية.\n\nمحمد العمراني كاتب ديال عدة منشورات وأبحاث مركزة على السياسات الفلاحية والتنمية القروية في المغرب. احد الأعمال البارزة ديالو هو دليل منهجي طبع في 2017، طبع ف مطبعة مرزاك في مكناس، المغرب.",
        "feedback": ""
    }
}