{
    "Adnane:economy:ar:ar:Définir ONCA": {
        "response": "‫L'ONCA désigne l'Office National du Conseil Agricole au Maroc. C'est un établissement public à caractère industriel et commercial qui a pour mission principale de promouvoir le conseil agricole et de renforcer les capacités des agriculteurs pour améliorer leur productivité et leurs revenus. L'ONCA joue un rôle crucial dans le développement du secteur agricole au Maroc en fournissant des services de conseil aux agriculteurs, en organisant des programmes de formation et en facilitant l'accès aux technologies agricoles modernes. Il collabore également avec différents acteurs du secteur agricole pour promouvoir une agriculture durable et compétitive. En résumé, l'ONCA est un pilier essentiel du développement agricole au Maroc en mettant l'accent sur le conseil, la formation et l'innovation pour soutenir les agriculteurs du pays.‬",
        "feedback": ""
    },
    "Adnane:premium:fr:fr:Définir l'ONCA": {
        "response": "L'Office National du Conseil Agricole (ONCA) est une organisation spécialisée dédiée à fournir des services de conseil agricole aux agriculteurs. Créée en vertu de la loi 58-12 promulguée par le Dahir N°1.12.67 du 4 Rabii I 1434 (16 Janvier 2013), l'ONCA a été instituée pour restructurer le réseau des entités locales de conseil agricole, en favorisant la mobilité des conseillers publics et l'optimisation des moyens disponibles. Ce processus a impliqué l'absorption de 122 Centres Techniques (CT) dans un seul établissement public.\n\nL'ONCA s'articule autour de trois grandes directions centrales : \n1. **Direction d’Ingénierie du Conseil Agricole** : Elle est chargée de coordonner et de suivre l'élaboration des plans d'action régionaux annuels de conseil agricole, de préparer les programmes et budgets annuels et pluriannuels à l'échelle nationale, et de participer à l'allocation des ressources nécessaires aux différents acteurs du conseil agricole.\n2. **Direction des Opérations**.\n3. **Direction des Ressources Humaines et Support**.\n\nL'objectif principal de l'ONCA est de garantir une bonne intégration dans son environnement institutionnel tout en répondant aux missions de conseil agricole. Elle oeuvre également au renforcement du partenariat public-privé, notamment en organisant le métier de conseiller agricole privé et en assurant son déploiement à l'échelle nationale dans le cadre de la contractualisation (loi 62-12).\n\nL'ONCA joue un rôle important dans le pilotage et la gouvernance du dispositif de conseil agricole au niveau national, tandis que les Directions Régionales du Conseil Agricole (DRCA) sont responsables de la coordination et de l'animation du conseil agricole au niveau régional. Les Centres de Conseil Agricole (CCA) récemment constitués agissent comme des points d'attractivité pour les agriculteurs, en offrant directement les services de conseil agricole aux niveaux local et régional.\n\nEnfin, l'ONCA met également en œuvre des initiatives de communication innovantes comme la production de vidéos en motion design et de podcasts agricoles pour faciliter le transfert de connaissances et le partage des bonnes pratiques agricoles parmi les agriculteurs et les conseillers agricoles. \n\nLa mission de l'ONCA est donc de renforcer l'efficacité des services de conseil agricoles afin de mieux servir les agriculteurs et de favoriser le développement agricole durable.",
        "feedback": ""
    }
}